#### Terraform Plan for `dev` 🏗️

<details>
<summary>Show Plan</summary>

```terraform
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=pipeops-dev-eks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.10.1-eksbuild.5"
      + arn                         = (known after apply)
      + cluster_name                = "pipeops-dev-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # aws_eks_addon.ebs_csi_driver will be created
  + resource "aws_eks_addon" "ebs_csi_driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.25.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "pipeops-dev-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.28.2-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "pipeops-dev-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.15.4-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "pipeops-dev-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # aws_iam_role.aws_load_balancer_controller will be created
  + resource "aws_iam_role" "aws_load_balancer_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pipeops-dev-eks-aws-load-balancer-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ebs_csi_driver will be created
  + resource "aws_iam_role" "ebs_csi_driver" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pipeops-dev-eks-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.external_secrets will be created
  + resource "aws_iam_role" "external_secrets" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pipeops-dev-eks-external-secrets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.aws_load_balancer_controller will be created
  + resource "aws_iam_role_policy" "aws_load_balancer_controller" {
      + id          = (known after apply)
      + name        = "pipeops-dev-eks-aws-load-balancer-controller"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:GetManagedPrefixListAssociations",
                          + "ec2:GetManagedPrefixListEntries",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:DescribeProtection",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeSubscription",
                          + "shield:DescribeEmergencyContactSettings",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateSecurityGroup",
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.external_secrets will be created
  + resource "aws_iam_role_policy" "external_secrets" {
      + id          = (known after apply)
      + name        = "pipeops-dev-eks-external-secrets"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ebs_csi_driver will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_driver" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/Amazon_EBS_CSI_DriverPolicy"
      + role       = "pipeops-dev-eks-ebs-csi-driver"
    }

  # helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.6.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "pipeops-dev-eks"
        }
      + set {
          + name  = "region"
          + value = "us-west-2"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
        }
    }

  # helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.9.11"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # random_password.argocd_admin will be created
  + resource "random_password" "argocd_admin" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.grafana_admin will be created
  + resource "random_password" "grafana_admin" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.argocd.aws_iam_role.argocd will be created
  + resource "aws_iam_role" "argocd" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pipeops-dev-eks-argocd-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + unique_id             = (known after apply)
    }

  # module.argocd.aws_iam_role_policy.argocd will be created
  + resource "aws_iam_role_policy" "argocd" {
      + id          = (known after apply)
      + name        = "pipeops-dev-eks-argocd-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "eks:DescribeCluster",
                          + "eks:DescribeNodegroup",
                          + "s3:GetObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.argocd.helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "5.51.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.argocd.kubernetes_annotations.argocd_server_sa will be created
  + resource "kubernetes_annotations" "argocd_server_sa" {
      + annotations   = (known after apply)
      + api_version   = "v1"
      + field_manager = "Terraform"
      + id            = (known after apply)
      + kind          = "ServiceAccount"

      + metadata {
          + name      = "argocd-server"
          + namespace = "argocd"
        }
    }

  # module.argocd.kubernetes_namespace.argocd will be created
  + resource "kubernetes_namespace" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "name"                               = "argocd"
              + "pod-security.kubernetes.io/audit"   = "privileged"
              + "pod-security.kubernetes.io/enforce" = "privileged"
              + "pod-security.kubernetes.io/warn"    = "privileged"
            }
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.cluster will be created
  + resource "aws_cloudwatch_log_group" "cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/pipeops-dev-eks/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all          = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # module.eks.aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "pipeops-dev-eks"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all                      = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + version                       = "1.28"

      + compute_config {
          + enabled    = true
          + node_pools = [
              + "general-purpose",
            ]
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = true
            }
        }

      + storage_config {
          + block_storage {
              + enabled = true
            }
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.auto_mode will be created
  + resource "aws_eks_node_group" "auto_mode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "pipeops-dev-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m5.large",
          + "m5.xlarge",
          + "m5.2xlarge",
        ]
      + node_group_name        = "pipeops-dev-eks-auto-mode-nodes"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all               = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + version                = (known after apply)

      + remote_access {
          + source_security_group_ids = (known after apply)
        }

      + scaling_config {
          + desired_size = 3
          + max_size     = 10
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be created
  + resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-eks-irsa"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all        = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-eks-irsa"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pipeops-dev-eks-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.node will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pipeops-dev-eks-eks-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy.cluster_auto_mode will be created
  + resource "aws_iam_role_policy" "cluster_auto_mode" {
      + id          = (known after apply)
      + name        = "pipeops-dev-eks-auto-mode-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:AttachNetworkInterface",
                          + "ec2:DetachNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeSecurityGroups",
                          + "autoscaling:*",
                          + "application-autoscaling:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.eks.aws_iam_role_policy.node_auto_scaling will be created
  + resource "aws_iam_role_policy" "node_auto_scaling" {
      + id          = (known after apply)
      + name        = "pipeops-dev-eks-node-auto-scaling"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "cloudwatch:PutMetricData",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeSnapshots",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "pipeops-dev-eks-eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.node_AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "pipeops-dev-eks-eks-node-role"
    }

  # module.eks.aws_iam_role_policy_attachment.node_AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "pipeops-dev-eks-eks-node-role"
    }

  # module.eks.aws_iam_role_policy_attachment.node_AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "pipeops-dev-eks-eks-node-role"
    }

  # module.eks.aws_kms_alias.eks will be created
  + resource "aws_kms_alias" "eks" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/pipeops-dev-eks-eks-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "EKS Secret Encryption Key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-eks-key"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all                           = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-eks-key"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # module.eks.aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.2.0.0/16",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "pipeops-dev-eks-cluster-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-cluster-sg"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all               = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-cluster-sg"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Control plane to nodes (HTTPS)"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Control plane to nodes"
              + from_port        = 1025
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "pipeops-dev-eks-node-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-node-sg"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all               = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-eks-node-sg"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster_to_nodes will be created
  + resource "aws_security_group_rule" "cluster_to_nodes" {
      + description              = "Control plane to nodes"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.rds.aws_cloudwatch_log_group.postgresql will be created
  + resource "aws_cloudwatch_log_group" "postgresql" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/instance/pipeops-dev-postgres/postgresql"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all          = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # module.rds.aws_cloudwatch_log_group.upgrade will be created
  + resource "aws_cloudwatch_log_group" "upgrade" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/instance/pipeops-dev-postgres/upgrade"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all          = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # module.rds.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 50
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "app"
      + db_subnet_group_name                  = "pipeops-dev-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.4"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "pipeops-dev-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.medium"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 1000
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = "pipeops-dev-postgres-options"
      + parameter_group_name                  = "pipeops-dev-postgres-params"
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-postgres"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
          + "Role"         = "primary"
        }
      + tags_all                              = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Name"         = "pipeops-dev-postgres"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
          + "Role"         = "primary"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_option_group.main will be created
  + resource "aws_db_option_group" "main" {
      + arn                      = (known after apply)
      + engine_name              = "postgres"
      + id                       = (known after apply)
      + major_engine_version     = "15"
      + name                     = "pipeops-dev-postgres-options"
      + name_prefix              = (known after apply)
      + option_group_description = "Option group for pipeops dev PostgreSQL"
      + skip_destroy             = false
      + tags                     = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all                 = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
    }

  # module.rds.aws_db_parameter_group.main will be created
  + resource "aws_db_parameter_group" "main" {
      + arn          = (known after apply)
      + description  = "Managed by Terraform"
      + family       = "postgres15"
      + id           = (known after apply)
      + name         = "pipeops-dev-postgres-params"
      + name_prefix  = (known after apply)
      + skip_destroy = false
      + tags         = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }
      + tags_all     = {
          + "AutoShutdown" = "enabled"
          + "CostCenter"   = "engineering"
          + "Criticality"  = "low"
          + "Environment"  = "dev"
          + "GitOps"       = "argocd"
          + "ManagedBy"    = "terraform"
          + "Owner"        = "platform-team"
          + "Project"      = "pipeops"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_disconnections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_duration_statement"
          + value        = "1000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_statement"
          + value        = "all"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "shared_preload_libraries"
          + value        = "pg_stat_statements"
        }
    }

  # module.rds.aws_iam_role.rds_monitoring will be created
  + resource "aws_iam_role" "rds_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  =...
[Plan output truncated]
```

</details>

*Pusher: @ozunuane, Action: `pull_request`, Environment: `dev`*